<?php

namespace gisgkh\types\HouseManagement;

/**
 * Сведения из ГКН для УО и ОМС
 */
class GKN_EGRP_KeyType
{
    /**
     * Поиск в ГКН/ЕГРП по кадастровому номеру объекта недвижимости. При указании осуществляется привязка к ГКН и ЕГРП при наличии этих сведений в рееестрах. Перечень Субъектов РФ, по которым размещена информация в ГКН/ЕГРП, можно уточнить у Оператора ГИС ЖКХ. Наличие в экспорте указывает на установленную связь с ГКН/ЕГРП по этому элементу. 
     * 
     * @var string
     */
     public $CadastralNumber = null;

    /**
     * Ключ связи с ГКН/ЕГРП отсутствует. Может быть указан только при отсутствии сведений в ГКН и ЕГРП по Субъекту РФ в ГИС ЖКХ. Перечень Субъектов РФ, по которым размещена информация в ГКН, можно уточнить у Оператора ГИС ЖКХ. 
     * 
     * @var string
     */
     public $No_RSO_GKN_EGRP_Registered = null;

    /**
     * Поиск в ЕГРП по условному номер ЕГРП. При указании осуществляется поиск по ЕГРП и автопривязка к найденным сведениям. Наличие в экспорте указывает на установленную связь с ЕГРП по этому элементу. 
     * 
     * @var string
     */
     public $ConditionalNumber = null;

    /**
     * Поиск в ЕГРП по регистрационным данным прав или ограничениям прав. Наличие в экспорте указывает на установленную связь с ЕГРП по этому элементам.
     * 
     * @var \gisgkh\types\HouseManagement\RightOrEncumbrance[]
     */
     public $RightOrEncumbrance = null;

    /**
     * @param string $CadastralNumber Поиск в ГКН/ЕГРП по кадастровому номеру объекта недвижимости. При указании осуществляется привязка к ГКН и ЕГРП при наличии этих сведений в рееестрах. Перечень Субъектов РФ, по которым размещена информация в ГКН/ЕГРП, можно уточнить у Оператора ГИС ЖКХ. Наличие в экспорте указывает на установленную связь с ГКН/ЕГРП по этому элементу. 
     * @param string $No_RSO_GKN_EGRP_Registered Ключ связи с ГКН/ЕГРП отсутствует. Может быть указан только при отсутствии сведений в ГКН и ЕГРП по Субъекту РФ в ГИС ЖКХ. Перечень Субъектов РФ, по которым размещена информация в ГКН, можно уточнить у Оператора ГИС ЖКХ. 
     * @param string $ConditionalNumber Поиск в ЕГРП по условному номер ЕГРП. При указании осуществляется поиск по ЕГРП и автопривязка к найденным сведениям. Наличие в экспорте указывает на установленную связь с ЕГРП по этому элементу. 
     * @param \gisgkh\types\HouseManagement\RightOrEncumbrance[] $RightOrEncumbrance Поиск в ЕГРП по регистрационным данным прав или ограничениям прав. Наличие в экспорте указывает на установленную связь с ЕГРП по этому элементам.
     */
    public function __construct(string $CadastralNumber = null, string $No_RSO_GKN_EGRP_Registered = null, string $ConditionalNumber = null, array $RightOrEncumbrance = null)
    {
        $this->CadastralNumber = $CadastralNumber;
        $this->No_RSO_GKN_EGRP_Registered = $No_RSO_GKN_EGRP_Registered;
        $this->ConditionalNumber = $ConditionalNumber;
        $this->RightOrEncumbrance = $RightOrEncumbrance;
    }
}