<?php

namespace gisgkh\types\HouseManagement;

/**
 * Сведения из ГКН и ЕГРП для экспорта
 */
class GKN_EGRP_KeyExportType
{
    /**
     * Поиск в ГКН/ЕГРП по кадастровому номеру объекта недвижимости. При указании осуществляется привязка к ГКН и ЕГРП при наличии этих сведений в рееестрах. Перечень Субъектов РФ, по которым размещена информация в ГКН/ЕГРП, можно уточнить у Оператора ГИС ЖКХ. Наличие в экспорте указывает на установленную связь с ГКН/ЕГРП по этому элементу. 
     * 
     * @var string
     */
     public $CadastralNumber = null;

    /**
     * Ключ связи с ГКН/ЕГРП отсутствует. Может быть указан только при отсутствии сведений в ГКН и ЕГРП по Субъекту РФ в ГИС ЖКХ. Перечень Субъектов РФ, по которым размещена информация в ГКН, можно уточнить у Оператора ГИС ЖКХ. 
     * 
     * @var string
     */
     public $No_RSO_GKN_EGRP_Registered = null;

    /**
     * Признак отсутствия у РСО, импортирующего дом, сведений о кадастровом номере и других ключей, позволяющих установить связь с ГКН/ЕГРП
     * 
     * @var string
     */
     public $No_RSO_GKN_EGRP_Data = null;

    /**
     * @param string [$CadastralNumber] Поиск в ГКН/ЕГРП по кадастровому номеру объекта недвижимости. При указании осуществляется привязка к ГКН и ЕГРП при наличии этих сведений в рееестрах. Перечень Субъектов РФ, по которым размещена информация в ГКН/ЕГРП, можно уточнить у Оператора ГИС ЖКХ. Наличие в экспорте указывает на установленную связь с ГКН/ЕГРП по этому элементу. 
     * @param string [$No_RSO_GKN_EGRP_Registered] Ключ связи с ГКН/ЕГРП отсутствует. Может быть указан только при отсутствии сведений в ГКН и ЕГРП по Субъекту РФ в ГИС ЖКХ. Перечень Субъектов РФ, по которым размещена информация в ГКН, можно уточнить у Оператора ГИС ЖКХ. 
     * @param string [$No_RSO_GKN_EGRP_Data] Признак отсутствия у РСО, импортирующего дом, сведений о кадастровом номере и других ключей, позволяющих установить связь с ГКН/ЕГРП
     */
    public function __construct(string $CadastralNumber = null, string $No_RSO_GKN_EGRP_Registered = null, string $No_RSO_GKN_EGRP_Data = null)
    {
        $this->CadastralNumber = $CadastralNumber;
        $this->No_RSO_GKN_EGRP_Registered = $No_RSO_GKN_EGRP_Registered;
        $this->No_RSO_GKN_EGRP_Data = $No_RSO_GKN_EGRP_Data;
    }
}